export const articleConfig = [
  {
    title: "Введение в JavaScript",
    content:
      "JavaScript — это язык программирования, который позволяет создавать интерактивные элементы на веб-страницах.",
  },
  {
    title: "Основы React",
    content:
      "React — это библиотека для построения пользовательских интерфейсов, разработанная Facebook.",
  },
  {
    title: "Понимание CSS Flexbox",
    content:
      "Flexbox — это метод компоновки элементов на странице, который позволяет легко управлять пространством между элементами.",
  },
  {
    title: "Работа с API",
    content:
      "API (Application Programming Interface) позволяет взаимодействовать с внешними сервисами и получать данные.",
  },
  {
    title: "Введение в Node.js",
    content:
      "Node.js — это среда выполнения JavaScript на стороне сервера, которая позволяет создавать масштабируемые сетевые приложения.",
  },
  {
    title: "Основы HTML",
    content:
      "HTML (HyperText Markup Language) — это стандартный язык разметки для создания веб-страниц.",
  },
  {
    title: "Управление состоянием в React",
    content:
      "Состояние в React позволяет управлять данными, которые могут изменяться в течение жизненного цикла компонента.",
  },
  {
    title: "Асинхронное программирование в JavaScript",
    content:
      "Асинхронное программирование позволяет выполнять операции, не блокируя основной поток выполнения.",
  },
  {
    title: "Тестирование приложений на JavaScript",
    content:
      "Тестирование помогает убедиться, что ваше приложение работает правильно и соответствует требованиям.",
  },
  {
    title: "Оптимизация производительности веб-приложений",
    content:
      "Оптимизация производительности включает в себя различные техники для улучшения скорости загрузки и работы приложения.",
  },
];
